components/notebooks/one_blockt/constant/RASProperties


FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
	object      RASProperties;
}
printCoeffs  off;
turbulence  false;
RAS  laminar;
