components/notebooks/one_blockt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3334;
        startFace       14871;
    }
    inlet0
    {
        type            inlet;
        nFaces          208;
        startFace       18205;
    }
    inlet1
    {
        type            inlet;
        nFaces          208;
        startFace       18413;
    }
)

// ************************************************************************* //
