components/notebooks/one_blockt/constant/transportProperties


FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
	object      transportProperties;
}
transportModel  Newtonian;
nu  [ 0 2 -1 0 0 0 0 ] 9.52380952381e-07;
