components/notebooks/one_blockt/system/controlDict


FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
	object      controlDict;
}
deltaT  1.0;
maxAlphaCo  0.5;
runTimeModifiable  yes;
startFrom  startTime;
startTime  0.0;
stopAt  endTime;
adjustTimeStep  yes;
endTime  10.0;
maxCo  0.5;
maxDeltaT  1.0;
timePrecision  6;
writeCompression  uncompressed;
writeFormat  ascii;
writeInterval  1.0;
timeFormat  general;
writeControl  timeStep;
writePrecision  12;
